IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/TIMERMGR0_TIMERS.xml
<module name="TIMERMGR0_TIMERS" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="TIMERS_TIMER_SETUP_VALUE" acronym="TIMERS_TIMER_SETUP_VALUE" offset="0x0" width="32" description="This reprograms timer N with the written value. This number will be the number of ticks of the timer_clock before the timer expires, if timer N and the timer manager itself are both enabled via TM_CTRL and TIMER_CONTROL_N">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="The number of ticks of the timer_clock before this timer would expire when reprogrammed" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="TIMERS_TIMER_CONTROL" acronym="TIMERS_TIMER_CONTROL" offset="0x4" width="32" description="Modifies the behavior of timer N with control signals below">
		<bitfield id="AUTO_RESET" width="1" begin="8" end="8" resetval="0x0" description="Automatically reset the timer when it expires. Provides the option of a periodic timer, rather than one that needs to be cleared after each expiration. Added for hardware usage of the timers, so the expirations can occur regularly without software reprogramming them." range="8" rwaccess="R/W"/> 
		<bitfield id="TIMER_EXPIRED" width="1" begin="2" end="2" resetval="0x0" description="The status of the current timer. 1 = expired" range="2" rwaccess="R"/> 
		<bitfield id="SET_TIMER" width="1" begin="1" end="1" resetval="0x0" description="This may be used to touch/set a timer. When a 1 is written, the corresponding timer will be refreshed with the current value in its TIMER_SETUP_VALUES register. Will always read 0" range="1" rwaccess="W"/> 
		<bitfield id="TIMER_ENABLED" width="1" begin="0" end="0" resetval="0x0" description="Write 1 to enable, 0 to disable the timer." range="0" rwaccess="R/W"/>
	</register>
</module>